class Solution {
    public long solution(int n) {
        // n = 1 : (1) : 1
        // n = 2 : (1,1) (2) : 2
        // n = 3 : (1,1,1) (1,2) (2,1) : 3 (1+2)
        // n = 4 : (1,1,1,1) (1,1,2) (1,2,1) (2,1,1) (2,2) : 5 (3+2)
        // n = 5 : (1,1,1,1,1) (1,1,1,2) (1,1,2,1) (1,2,1,1) (2,1,1,1) (1,2,2) (2,1,2) (2,2,1) : 8 (5+3)
        // --> f(n) = f(n-1) + f(n-2)
        
        long[] ans_arr = new long[2001];
        // n+1 로 동적으로 받게 되면 n=1 일때 오류가 발생한다
        ans_arr[0] = 0;
        ans_arr[1] = 1;
        ans_arr[2] = 2;
        
        for (int i = 3; i <= n; i++) {
            ans_arr[i] = (ans_arr[i-1] + ans_arr[i-2]) % 1234567;
        }
        
        return ans_arr[n];
    }
}